OpenFOAM_Examples/Quasi_DNS_Dowtherm_Mixed_Conv/expt_IDDESCase11_IDDES_mesh/0/turbulenceProperties:epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      turbulenceProperties:epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];


internalField   nonuniform List<scalar> 
252800
(
4.05e-06
4.05e-06
4.05e-06
4.05e-06
4.05e-06
4.05e-06
4.05e-06
4.05e-06
...
)
;

boundaryField
{
    leftWall
    {
        type            omegaWallFunction;
        blended         1;
        beta1           0.075;
        value           uniform 4.05e-06;
    }
    rightWall
    {
        type            omegaWallFunction;
        blended         1;
        beta1           0.075;
        value           uniform 4.05e-06;
    }
    leftSides_periodic0
    {
        type            cyclic;
    }
    leftSides_periodic1
    {
        type            cyclic;
    }
    rightSides_periodic0
    {
        type            cyclic;
    }
    rightSides_periodic1
    {
        type            cyclic;
    }
    leftInOut_periodic0
    {
        type            cyclic;
    }
    leftInOut_periodic1
    {
        type            cyclic;
    }
    rightInOut_periodic0
    {
        type            cyclic;
    }
    rightInOut_periodic1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
